In [11]:
#Bibek Shiwakoti
import pandas as pd
df1 =pd.read_csv('../data/2_customers.csv')
df2=pd.read_csv('../data/3_transactions.csv')
df1.head()

,id,cust_name,num_products,province,len_relationship,cust_category
0,1001,Johnny Awesome,3,ON,1,wealth
1,1002,Bob Marley,4,ON,1,personal_banking
2,1004,Taylor Swift,2,AB,2,hnw
3,1101,James Dean,3,BC,3,wealth
4,1006,Stephen Smith,5,ON,4,hnw

In [61]:
df1.shape

(13, 6)

In [10]:
df2.head()

   id  customer_id txn_type  txn_total
0   1         1001    Debit     165.78
1   2         1001   Credit      42.10
2   4         1001   Credit     103.03
3   5         1001   Credit      56.60
4   6         1002    Debit     214.34

In [62]:
df2.shape

(34, 4)

Q1. Write a function to display a Series object with only the names of Wealth customers.

In [28]:
df1[['cust_name']][df1['cust_category']=='wealth']

         cust_name
0   Johnny Awesome
3       James Dean
7       Maria Alva
11    Steven Prime

Q2. Write a function to identify all PersonalBanking customers with more than 3 products.

In [71]:
# df1[['cust_name']][df1['num_products']>3][df1['cust_category']=='personal_banking']
#above line gave some warnings so we can rectify the line as follows


df1.loc[(df1['num_products'] > 3) & (df1['cust_category'] == 'personal_banking'), ['cust_name']]

      cust_name
1    Bob Marley
8  Jessica Fast

Q3. What is the average spend of customers in Alberta?

In [43]:
# we have to join the dataframes based on id on df1 which is customer_id in df2 
merged_df = pd.merge(df1, df2, left_on='id', right_on='customer_id')

# filtering the provinces with value AB
alberta_customers = merged_df[merged_df['province'] == 'AB']

# Calculate the average spend of customers in AB
average_spend_alberta = alberta_customers['txn_total'].mean()

print('Average spend of customers in alberta is:',average_spend_alberta)

Average spend of customers in alberta is: 208.97636363636366

In [63]:
merged_df.head()   #looking at the top values of merged dataframe

,id_x,cust_name,num_products,province,len_relationship,cust_category,id_y,customer_id,txn_type,txn_total
0,1001,Johnny Awesome,3,ON,1,wealth,1,1001,Debit,165.78
1,1001,Johnny Awesome,3,ON,1,wealth,2,1001,Credit,42.10
2,1001,Johnny Awesome,3,ON,1,wealth,4,1001,Credit,103.03
3,1001,Johnny Awesome,3,ON,1,wealth,5,1001,Credit,56.60
4,1002,Bob Marley,4,ON,1,personal_banking,6,1002,Debit,214.34

Q4. How many personal banking customers are there in each province?

In [45]:
# Count the number of personal banking customers in each province
personal_banking_counts = df1[df1['cust_category'] == 'personal_banking'].groupby('province').size().reset_index(name='num_personal_banking_customers')


print(personal_banking_counts)

  province  num_personal_banking_customers
0       AB                               1
1       BC                               2
2       ON                               2

Q5. Who are the top 3 customers with the highest spend?

In [53]:
top_3_customers = merged_df.nlargest(3, 'txn_total')[['cust_name', 'txn_total']]

print(top_3_customers)

             cust_name  txn_total
11       Delilah Avery     449.39
21        Jessica Fast     438.29
23  Mariah Anita Smith     403.62

Q6. Which customer has the highest single transaction?

In [59]:

# Find the customer with the highest transaction amount
customer_with_highest_transaction = merged_df.loc[merged_df['txn_total'].idxmax()]

print(customer_with_highest_transaction['cust_name'])

Delilah Avery

Q7. What is the average spend by Province and Customer Category?

In [49]:
# Calculate the average spend by Province and Customer Category
average_spend_by_category = merged_df.groupby(['province', 'cust_category'])['txn_total'].mean().reset_index()

print(average_spend_by_category)

  province     cust_category   txn_total
0       AB               hnw  147.952000
1       AB  personal_banking  233.476667
2       AB            wealth  286.183333
3       BC  personal_banking  285.260000
4       MB               hnw  199.730000
5       ON               hnw  225.890000
6       ON  personal_banking  172.300000
7       ON            wealth  168.415714

Q8. What is the average spend by transaction type (e.g. credit, debit, cash)?

In [50]:
# Calculate the average spend by transaction type
average_spend_by_transaction_type = merged_df.groupby('txn_type')['txn_total'].mean().reset_index()

print(average_spend_by_transaction_type)

  txn_type   txn_total
0     Cash  182.262727
1   Credit  206.926667
2    Debit  227.204286

Q9. What is the average spend by transaction type (e.g. credit, debit, cash)?

In [ ]:
# same question as of the above question number 8.
# Get the row with the highest count for each province
idx = most_popular_txn_type_by_province.groupby('province')['count'].idxmax()
result = most_popular_txn_type_by_province.loc[idx]

# Print the result
print(result)